# GetReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceWithContext..::..GetReference Method
ReferenceWithContext Class See Also
---
Gets the reference of the geometric object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Reference GetReference()
```

Visual Basic
---
```text
Public Function GetReference As Reference
```

Visual C++
---
```text
public:
Reference^ GetReference()
```

# ### Return Value
The reference of a geometric object when it is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
# See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace